{
  "entries": [
    {
      "slug": "dot-field",
      "title": "Dot Field",
      "summary": "A deep dive into the homepage dot field — how each mode bends the grid and why the motion feels alive.",
      "content": "<h1>The Dot Field&#39;s Hidden Choreography</h1>\n<p>Imagine stepping into a planetarium where the constellations ignore the ceiling and instead orbit around you, whispering every tweak in gravity through graceful motion. It’s equal parts murmuration of starlings and midnight fountain show, and that’s the feeling the homepage’s dot field aims to deliver. It is a performance that blends shader math, responsive choreography, and a surprising amount of empathy for the viewer—from the first pixel that fades in to the last ripple that bows out.</p>\n<h2>The Cast Behind the Curtain</h2>\n<ul>\n<li><strong>SceneCanvas</strong> (<code>components/SceneCanvas.jsx</code>) is the stage manager and lighting designer rolled into one. It creates a 70 × 70 lattice of points (4,900 total) spaced 90 units apart, then hands their motion to a custom <code>THREE.Points</code> shader. Each dot draws itself as a soft disc using <code>gl_PointCoord</code>, additive blending, and uniforms for brightness and size so the field gleams without hard edges.</li>\n<li><strong>FIELD_DEFAULT_BASE</strong> (<code>lib/fieldDefaults.js</code>) establishes the “house band” settings: wave frequencies, ripple decay, swirl strength, point size, fog density, and more. These values are the baseline mood the animation eases back to whenever an effect finishes.</li>\n<li><strong>FIELD_DEFAULT_INFLUENCES</strong> tweaks that baseline per channel. Navigating to <code>/projects</code> or <code>/sounds</code> doesn’t swap the animation wholesale; it simply nudges parameters so the grid feels tailored to the content.</li>\n<li><strong>SceneCanvas` state machine</strong> keeps track of pointer energy, queued ripples, mode-specific data, and even mobile vs. desktop camera profiles. Think of it as a conductor’s score that knows which section should come in next, or a theme park ride manual that ensures every seat belts in at the right moment.</li>\n</ul>\n<h2>How the Motion Flows</h2>\n<p>At its core, the dot field layers three sinusoids: one that marches along the X axis, another offset along Y, and a radial swirl that wraps the grid into gentle spirals. This base motion gives the field a tide-like cadence—part ocean swell, part breathing dragon. On top of that:</p>\n<ul>\n<li>Pointer movement is translated into “world” coordinates and stored with a live energy meter. Sudden moves spike the energy; inactivity lets it decay (<code>pointer.energy = pointer.energy * 0.92 - 0.002</code>), so the dots never lurch when you stop interacting. It’s the same feedback loop you feel on a well-tuned skateboard where momentum rewards gentle carving.</li>\n<li>Clicks enqueue ripples that expand outward with exponential falloff. Each ripple tracks its age, distance, and strength, then fades after eight seconds—like dropping a pebble into an infinite koi pond and watching the rings dissolve, or striking a gong and hearing the shimmer soften into silence.</li>\n<li>The camera orbits on a subtle autopilot and lerps toward pointer offsets. Instead of an instant jump, it glides with coefficients around <code>0.04–0.045</code>, echoing the way a steadicam operator anticipates the next beat or a hot-air balloon drifts toward a new thermal.</li>\n</ul>\n<h2>Effect Library: Nine Alternate Universes</h2>\n<p>The animation stores a library of effect definitions—Zen, Jitter, Reaction Diffusion, Starfield, Harmonic Pendulum, Mandelbrot Zoom, and more. Triggering an effect executes four passages:</p>\n<ol>\n<li><strong>init</strong> seeds per-effect memory (double pendulum angles, Gray-Scott buffers, etc.).</li>\n<li><strong>start</strong> retunes the global settings (brightness, amplitude, ripple behaviour).</li>\n<li><strong>update</strong> evolves the custom state frame to frame.</li>\n<li><strong>perPoint</strong> injects per-particle offsets, scales, and lighting.</li>\n</ol>\n<p>Each effect is like inviting a guest conductor to reinterpret the score, or letting a guest chef borrow the kitchen for a one-night tasting menu. The Harmonic Pendulum mode sums the influence of three real-time double pendulums for chaotic waves. River Run steers sine currents diagonally while layering fractal noise to conjure eddies. Starfield lifts the dots into a faux z-axis, interpolating twinkle phases so the grid dissolves into a nebula before gracefully landing. Even Mandelbrot Zoom computes 32 iterations per point, letting the dots map the fractal boundary as they breathe in and out like accordion bellows.</p>\n<h2>The Secret Sauce of Smoothness</h2>\n<p>Smoothness here comes from a stack of easing decisions:</p>\n<ul>\n<li><strong>Target vs. live settings.</strong> Rather than flipping values instantly, the animation walks every property toward its target with <code>settings[key] += (targetSettings[key] - settings[key]) * 0.05</code>. The result is a mellow glide anytime a mode or menu influence shifts the parameters—think of dimming the lights with a slider instead of a switch.</li>\n<li><strong>Envelope functions everywhere.</strong> Effects lean on <code>smoothStep</code> and custom <code>computeEffectEase</code> helpers for ramping in and out. Even fade-outs square the progress curve to keep endings soft, like a choir sustaining its final note until the room exhales.</li>\n<li><strong>Pointer damping.</strong> Energy builds quickly but bleeds away exponentially, so motion feels alive while dragging yet settles like sand the moment you pause.</li>\n<li><strong>Deferred effect clearing.</strong> When a timed effect ends, it triggers a 2.5-second fade where the per-point contributions shrink while the UI synchronizes its own transition. Nothing snaps off-stage.</li>\n<li><strong>Responsive camera profiles.</strong> Desktop and mobile have tailored orbits, and <code>matchMedia(&#39;(max-width: 640px)&#39;)</code> swaps profiles instantly when viewports change—no layout jolts when rotating a phone.</li>\n</ul>\n<p>Taken together, the animation feels more like a jazz quartet warming up than a deterministic loop. Transitions are phrases, not toggles.</p>\n<h2>Visual Polish and Reader Comfort</h2>\n<ul>\n<li>The shader discards fragments outside a quarter-radius circle, then applies a <code>smoothstep</code> falloff. That feathered edge is the difference between retro CRT glow and a blocky pixel artifact—more vinyl record warmth than bitcrushed MP3 fatigue.</li>\n<li>Colors stay grayscale, but contrast and brightness stretch dynamically with height. Dots closer to the crest grow larger and brighter, mimicking stage lights following a dancer.</li>\n<li>Additive blending plus Reinhard tone mapping pushes bright peaks without blowing out the midtones; it’s the visual equivalent of compressing a track so whispers and shouts coexist.</li>\n<li>Accessibility is baked in. The scene respects <code>prefers-reduced-motion</code>, jumping straight to a stable state with <code>requestAnimationFrame</code>-synced readiness to avoid flashes during load.</li>\n</ul>\n<h2>Picture Prompts</h2>\n<ul>\n<li>Snapshot the default grid from a high angle, annotating the X/Y wave layers like a topographic map, to show how sinusoids interleave.</li>\n<li>Capture a GIF of ripple propagation, overlaying concentric circles like a water droplet diagram.</li>\n<li>Render the effect menu as a “guest conductor” lineup poster, pairing each mode with its signature waveform icon.</li>\n<li>Split-screen a standard view and the <code>prefers-reduced-motion</code> fallback to illustrate the empathetic loading path.</li>\n</ul>\n<h2>Technical Tidbits Worth Sharing</h2>\n<ul>\n<li>The Perlin permutation table is precomputed into a 512-entry lookup. That noise powers flowing effects like River Run without allocating intermediate arrays every frame.</li>\n<li>Ripple queues cap at 20 entries to prevent runaway accumulation, and old ones are culled after eight seconds, keeping perf flat over long sessions.</li>\n<li>The grid is marked <code>frustumCulled = false</code> so the renderer keeps it alive even when the camera pushes deep into the orbit—no accidental pop-out at extreme angles.</li>\n<li>Stats.js hooks stay hidden unless toggled via admin controls, but they’re ready for experimentation when dialing new modes.</li>\n<li>The scene toggles a <code>.is-ready</code> class one frame after initialization (or immediately for reduced-motion users), letting CSS coordinate entrance animations with WebGL readiness.</li>\n</ul>\n<h2>Why It Feels So Good</h2>\n<p>The magic of the dot field isn’t in any single waveform. It’s the way every system—pointer energy, ripple queues, effect envelopes, camera interpolation—leans toward empathy. The animation listens to you, interprets your inputs like a jazz pianist riffing on a theme, and gives each mode a chance to shine without crowding the stage.</p>\n<p>Or, to borrow an analogy from the kitchen: this piece is less a recipe and more a well-seasoned cast iron skillet. Each layer of math and polish is a seasoning that makes the next performance taste better. Whether you’re dropping into Zen Mode for meditative drift or firing up Jitter for fireworks, the pan is ready, warm, and welcoming—like a trusted family instrument that only gets sweeter with each jam.</p>\n<h2>Future Improvisations (Tech Notes)</h2>\n<ul>\n<li><strong>GPU instancing for richer sprites.</strong> Experiment with instanced quads and a tiny texture atlas so certain modes can introduce comet tails or hex particles without tanking fill rate.</li>\n<li><strong>WebGL 2 framebuffers.</strong> Render secondary simulations (reaction diffusion, velocity fields) into framebuffers once per frame, then sample them in the main shader to reduce CPU-to-GPU chatter.</li>\n<li><strong>Audio-reactive hooks.</strong> Pipe Web Audio API FFT data into the influence map so bass hits can trigger ripple bursts or modulation envelopes.</li>\n<li><strong>Adaptive grid density.</strong> Scale <code>AMOUNTX</code>/<code>AMOUNTY</code> and <code>SEPARATION</code> based on device performance metrics, keeping low-power hardware smooth while letting desktops enjoy denser fields.</li>\n<li><strong>Gesture memories.</strong> Record recent pointer paths in a trailing buffer so the field can replay your last 10 seconds of interaction as a ghost overlay when you go idle.</li>\n<li><strong>Editor UX polish.</strong> Extend the admin presets with inline sparklines previewing waveforms so curators can “hear” the mode before it plays.</li>\n</ul>\n<p>So enjoy the show, and when you craft the next effect, remember—you’re not just moving pixels. You’re inviting the dots to dance.</p>",
      "tags": [
        "generative art",
        "shader",
        "dot field"
      ],
      "coverImage": null,
      "status": "published",
      "createdAt": "2024-12-15"
    }
  ]
}